app/controllers/application_controller.rb

  def set_user_language
    lan = Configuration.find_by_config_key("Locale")
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'Locale') LIMIT 1