app/controllers/student_controller.rb

  def admission1
    @student = Student.new(params[:student])
    @guardians = Guardian.new(params[:guardians])
    @selected_value = Configuration.default_country
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = Configuration.find_by_config_key('AdmissionNumberAutoIncrement')
    @categories = StudentCategory.active
    if request.post?
      if @config.config_value.to_i == 1
        @exist = Student.find_by_admission_no(params[:student][:admission_no])
        if @exist.nil?
          @status = @student.save
---
SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '11232') LIMIT 1
INSERT INTO `students` (`class_roll_no`, `immediate_contact_id`, `is_sms_enabled`, `has_paid_fees`, `nationality_id`, `language`, `address_line1`, `address_line2`, `city`, `status_description`, `pin_code`, `is_deleted`, `created_at`, `updated_at`, `last_name`, `date_of_birth`, `state`, `photo_file_name`, `is_active`, `middle_name`, `photo_file_size`, `user_id`, `admission_date`, `gender`, `email`, `photo_content_type`, `batch_id`, `blood_group`, `student_category_id`, `photo_data`, `admission_no`, `religion`, `phone1`, `phone2`, `first_name`, `birth_place`, `country_id`) VALUES(NULL, NULL, 1, 0, 76, 'Telugu', 'Bangalore', 'Bangalore', 'Bangalore', NULL, '515711', 0, '2012-11-26 04:48:18', '2012-11-26 04:48:18', 'Kurmam', '2007-11-27', 'Karnataka', 'pic-lrg.jpg', 1, 'Kumar', 2998, 2, '2012-11-26', 'm', 'ashok@dine-media.com', 'image/jpeg', 1, '', NULL, NULL, '11233', 'Hindu', '9985856223', '9642385843', 'Ashok', 'Anantapur', 76)

  def admission2
    @student = Student.find params[:id], :include => [:guardians]
    @guardian = Guardian.new params[:guardian]
    if request.post? and @guardian.save
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT `guardians`.* FROM `guardians` WHERE (`guardians`.ward_id = 1)
INSERT INTO `guardians` (`city`, `state`, `education`, `ward_id`, `user_id`, `office_address_line1`, `office_address_line2`, `office_phone1`, `office_phone2`, `created_at`, `updated_at`, `last_name`, `country_id`, `dob`, `first_name`, `relation`, `email`, `mobile_phone`, `occupation`, `income`) VALUES('Bangalore', 'Karnataka', 'inter', 2, NULL, 'Bangalore', 'Bangalore', '9703487387', '8095150335', '2012-11-27 08:01:48', '2012-11-27 08:01:48', 'Kumar', 130, '1992-11-03', 'Kistaiah', 'father', 'kitti@gmail.com', '9642385843', 'good', '5,000')

  def admission3
    @student = Student.find(params[:id])
    @parents = @student.guardians
    if @parents.empty?
      redirect_to :controller => "student", :action => "previous_data", :id => @student.id
    end
    return if params[:immediate_contact].nil?
    if request.post?
      sms_setting = SmsSetting.new()
      @student = Student.update(@student.id, :immediate_contact_id => params[:immediate_contact][:contact])
      if sms_setting.application_sms_active and @student.is_sms_enabled
        recipients = []
        message = "#{t('student_admission_done')}  #{@student.admission_no} #{t('password_is')} #{@student.admission_no}123"
        if sms_setting.parent_sms_active
          guardian = Guardian.find(@student.immediate_contact_id)
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `guardians` WHERE (`guardians`.ward_id = 1)
SELECT count(*) AS count_all FROM `guardians` WHERE (`guardians`.ward_id = 1)
UPDATE `guardians` SET `user_id` = 4, `updated_at` = '2012-11-28 10:46:04' WHERE `id` = 1
UPDATE `students` SET `updated_at` = '2012-11-27 08:02:00', `immediate_contact_id` = 2 WHERE `id` = 2
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 2)
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '11234' AND `students`.id <> 2) LIMIT 1

  def admission3_1
    @student = Student.find(params[:id])
    @parents = @student.guardians
    if @parents.empty?
      redirect_to :controller => "student", :action => "admission4", :id => @student.id
    end
    return if params[:immediate_contact].nil?
    if request.post?
      sms_setting = SmsSetting.new()
      @student = Student.update(@student.id, :immediate_contact_id => params[:immediate_contact][:contact])
      if sms_setting.application_sms_active and @student.is_sms_enabled
        recipients = []
        message = "#{t('student_admission_done')}   #{@student.admission_no} #{t('password_is')}#{@student.admission_no}123"
        if sms_setting.parent_sms_active
          guardian = Guardian.find(@student.immediate_contact_id)
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `guardians` WHERE (`guardians`.ward_id = 1)
SELECT count(*) AS count_all FROM `guardians` WHERE (`guardians`.ward_id = 1)
UPDATE `guardians` SET `updated_at` = '2012-11-27 10:33:00', `user_id` = 5 WHERE `id` = 3
UPDATE `students` SET `immediate_contact_id` = 3, `updated_at` = '2012-11-27 10:33:00' WHERE `id` = 1
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 3)
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '11233' AND `students`.id <> 1) LIMIT 1

  def previous_data
    @student = Student.find(params[:id])
    @previous_data = StudentPreviousData.new params[:student_previous_details]
    @previous_subject = StudentPreviousSubjectMark.find_all_by_student_id(@student)
    if request.post?
      @previous_data.save
---
SELECT * FROM `students` WHERE (`students`.`id` = 2)
SELECT * FROM `student_previous_subject_marks` WHERE (`student_previous_subject_marks`.`student_id` = 2)
INSERT INTO `student_previous_datas` (`institution`, `course`, `total_mark`, `student_id`, `year`) VALUES('fsadf', 'dsfsdf', '398', 1, '1234')

  def previous_subject
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 2)

  def save_previous_subject
    @previous_subject = StudentPreviousSubjectMark.new params[:student_previous_subject_details]
    @previous_subject.save
---
INSERT INTO `student_previous_subject_marks` (`mark`, `subject`, `student_id`) VALUES('45', 'maths', 2)

  def admission4
    @student = Student.find(params[:id])
    @additional_fields = StudentAdditionalField.find(:all, :conditions=> "status = true")
    if @additional_fields.empty?
      flash[:notice] = "#{t('flash9')} #{@student.first_name} #{@student.last_name}."
      redirect_to :controller => "student", :action => "profile", :id => @student.id
    end
    if request.post?
      params[:student_additional_details].each_pair do |k, v|
        StudentAdditionalDetail.create(:student_id => params[:id],
          :additional_field_id => k,:additional_info => v['additional_info'])
---
SELECT * FROM `students` WHERE (`students`.`id` = 2)
SELECT * FROM `student_additional_fields` WHERE (status = true)
INSERT INTO `student_additional_details` (`student_id`, `additional_info`, `additional_field_id`) VALUES(1, 'ashok', 1)

  def add_additional_details
    @additional_details = StudentAdditionalField.find(:all)
    @additional_field = StudentAdditionalField.new(params[:additional_field])
    if request.post? and @additional_field.save
---
INSERT INTO `student_additional_fields` (`status`, `name`) VALUES(1, 'kumar')

  def edit
    @student = Student.find(params[:id])
    @student_user = @student.user
    @student_categories = StudentCategory.active
    @batches = Batch.active
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")

    if request.post?
      unless params[:student][:image_file].blank?
        unless params[:student][:image_file].size.to_f > 280000
          if @student.update_attributes(params[:student])
            unless @student.changed.include?('admission_no')
              @student_user.update_attributes(:username=> @student.admission_no,:password => "#{@student.admission_no.to_s}123",:first_name=> @student.first_name , :last_name=> @student.last_name, :email=> @student.email, :role=>'Student')
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
UPDATE `students` SET `photo_file_size` = 11262, `photo_file_name` = 'chocolate.jpg', `updated_at` = '2012-11-26 11:57:58' WHERE `id` = 1
UPDATE `users` SET `updated_at` = '2012-11-27 06:00:04', `hashed_password` = 'e93a96837f10b10265a748a23b2729f9c674bdef' WHERE `id` = 2
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '11233' AND `students`.id <> 1) LIMIT 1
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY '11233' AND `users`.id <> 2) LIMIT 1

  def reports
    @batch = @student.batch
    @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
    @normal_subjects = Subject.find_all_by_batch_id(@batch.id,:conditions=>"no_exams = false AND elective_group_id IS NULL AND is_deleted = false")
    @student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>{:batch_id=>@batch.id})
    @elective_subjects = []
    @student_electives.each do |e|
      @elective_subjects.push Subject.find(e.subject_id)
---
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 1)
SELECT * FROM `subjects` WHERE (no_exams = false AND elective_group_id IS NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (`students_subjects`.`batch_id` = 1) AND (`students_subjects`.`student_id` = 1)
SELECT * FROM `students` WHERE (`students`.user_id = 2) LIMIT 1
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)

  def search_ajax
    if params[:option] == "active"
      if params[:query].length>= 3
        @students = Student.find(:all,
          :conditions => ["first_name LIKE ? OR middle_name LIKE ? OR last_name LIKE ?
                            OR admission_no = ? OR (concat(first_name, \" \", last_name) LIKE ? ) ",
            "#{params[:query]}%","#{params[:query]}%","#{params[:query]}%",
            "#{params[:query]}", "#{params[:query]}" ],
          :order => "batch_id asc,first_name asc",:include =>  [{:batch=>:course}]) unless params[:query] == ''
      else
        @students = Student.find(:all,
          :conditions => ["admission_no = ? " , params[:query]],
          :order => "batch_id asc,first_name asc",:include =>  [{:batch=>:course}]) unless params[:query] == ''
      end
      render :layout => false
    else
      if params[:query].length>= 3
        @archived_students = ArchivedStudent.find(:all,
          :conditions => ["first_name LIKE ? OR middle_name LIKE ? OR last_name LIKE ?
                            OR admission_no = ? OR (concat(first_name, \" \", last_name) LIKE ? ) ",
            "#{params[:query]}%","#{params[:query]}%","#{params[:query]}%",
            "#{params[:query]}", "#{params[:query]}" ],
          :order => "batch_id asc,first_name asc",:include =>  [{:batch=>:course}]) unless params[:query] == ''
      else
---
SELECT * FROM `archived_students` WHERE (admission_no = 'mo' ) ORDER BY batch_id asc,first_name asc
SELECT * FROM `students` WHERE (first_name LIKE 'mohan%' OR middle_name LIKE 'mohan%' OR last_name LIKE 'mohan%'

  def add_guardian
    @parent_info = Guardian.new(params[:parent_detail])
    @countries = Country.all
    if request.post? and @parent_info.save
---
SELECT * FROM `countries`
INSERT INTO `guardians` (`office_address_line1`, `office_address_line2`, `city`, `user_id`, `last_name`, `email`, `office_phone1`, `office_phone2`, `created_at`, `dob`, `first_name`, `updated_at`, `education`, `mobile_phone`, `country_id`, `occupation`, `ward_id`, `state`, `relation`, `income`) VALUES('Bangalore', 'Bangalore', 'Bangalore', NULL, 'fdgdfggd', 'mohan@dine-media.com', '99858565523', '99858556252', '2012-11-27 10:32:34', '1992-11-25', 'drgdfgd', '2012-11-27 10:32:34', 'ghgfh', '99858858565', 76, 'hgfhgfh', 1, 'Karnataka', 'ghgfhgf', '22')

  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')
---
SELECT * FROM `students` WHERE (`students`.`batch_id` = '1') ORDER BY first_name ASC

  def profile
    @current_user = current_user
    @address = @student.address_line1.to_s + ' ' + @student.address_line2.to_s
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @sms_module = Configuration.available_modules
    @sms_setting = SmsSetting.new
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''
---
SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 2)
SELECT * FROM `students` WHERE (`students`.user_id = 2) LIMIT 1

  def profile_pdf
    @current_user = current_user
    @student = Student.find(params[:id])
    @address = @student.address_line1.to_s + ' ' + @student.address_line2.to_s
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @sms_module = Configuration.available_modules
    @sms_setting = SmsSetting.new
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 1)

  def show_previous_details
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @previous_subjects = StudentPreviousSubjectMark.find_all_by_student_id(@student.id)
---
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 2) LIMIT 1
SELECT * FROM `student_previous_subject_marks` WHERE (`student_previous_subject_marks`.`student_id` = 2)

  def categories
    @student_categories = StudentCategory.active
    @student_category = StudentCategory.new(params[:student_category])
    if request.post? and @student_category.save
---
INSERT INTO `student_categories` (`is_deleted`, `name`) VALUES(0, 'KDG')

  def advanced_search
    @batches = Batch.all
    @search = Student.search(params[:search])
    if params[:search]
      unless params[:advv_search][:course_id].empty?
        if params[:search][:batch_id_equals].empty?
          batches = Batch.find_all_by_course_id(params[:advv_search][:course_id]).collect{|b|b.id}
        end
      end
      if batches.is_a?(Array)

        @students = []
        batches.each do |b|
          params[:search][:batch_id_equals] = b
          if params[:search][:is_active_equals]=="true"
            @search = Student.search(params[:search])
            @students+=@search.all
          elsif params[:search][:is_active_equals]=="false"
            @search = ArchivedStudent.search(params[:search])
---
SELECT * FROM `batches`
SELECT * FROM `students` WHERE ((students.first_name LIKE '%admin%') OR (students.middle_name LIKE '%admin%') OR (students.last_name LIKE '%admin%'))
SELECT * FROM `archived_students` WHERE ((archived_students.first_name LIKE '%admin%') OR (archived_students.middle_name LIKE '%admin%') OR (archived_students.last_name LIKE '%admin%'))

      @searched_for += "<span>#{t('name')}: </span>" + params[:search][:first_name_or_middle_name_or_last_name_like].to_s unless params[:search][:first_name_or_middle_name_or_last_name_like].empty?
      @searched_for += " <span>#{t('admission_no')}: </span>" + params[:search][:admission_no_equals].to_s unless params[:search][:admission_no_equals].empty?
      unless params[:advv_search][:course_id].empty?
        course = Course.find(params[:advv_search][:course_id])
        batch = Batch.find(params[:search][:batch_id_equals]) unless (params[:search][:batch_id_equals]).blank?
        @searched_for += "<span>#{t('course_text')}: </span>" + course.full_name
        @searched_for += "<span>#{t('batch')}: </span>" + batch.full_name unless batch.nil?
      end
      @searched_for += "<span>#{t('category')}: </span>" + StudentCategory.find(params[:search][:student_category_id_equals]).name.to_s unless params[:search][:student_category_id_equals].empty?
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 2)
SELECT * FROM `student_categories` WHERE (`student_categories`.`id` = 1)

  def list_batches
    unless params[:course_id] == ''
      @batches = Batch.find(:all, :conditions=>"course_id = #{params[:course_id]}",:order=>"id DESC")
---
SELECT * FROM `batches` WHERE (course_id = 1) ORDER BY id DESC

  def electives
    @batch = Batch.find(params[:id])
    @elective_subject = Subject.find(params[:id2])
    @students = @batch.students
    @elective_group = ElectiveGroup.find(@elective_subject.elective_group_id)
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`id` = 1)

  def assign_students
    @student = Student.find(params[:id])
    StudentsSubject.create(:student_id=>params[:id],:subject_id=>params[:id2],:batch_id=>@student.batch_id)
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)
INSERT INTO `students_subjects` (`subject_id`, `student_id`, `batch_id`) VALUES(2, 1, 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)

  def unassign_students
    StudentsSubject.find_by_student_id_and_subject_id(params[:id],params[:id2]).delete
    @student = Student.find(params[:id])
    @elective_subject = Subject.find(params[:id2])
---
DELETE FROM `students_subjects` WHERE (`id` IN (1))
SELECT * FROM `students_subjects` WHERE (`students_subjects`.`student_id` = '1' AND `students_subjects`.`subject_id` = '2') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)

  def fees
    @dates = FinanceFeeCollection.find_all_by_batch_id(@student.batch ,:joins=>'INNER JOIN finance_fees ON finance_fee_collections.id = finance_fees.fee_collection_id',:conditions=>"finance_fees.student_id = #{@student.id} and finance_fee_collections.is_deleted = 0")
---
SELECT `finance_fee_collections`.* FROM `finance_fee_collections` INNER JOIN finance_fees ON finance_fee_collections.id = finance_fees.fee_collection_id WHERE (finance_fees.student_id = 1 and finance_fee_collections.is_deleted = 0) AND (`finance_fee_collections`.`batch_id` = 1)

  def find_student
    @student = Student.find params[:id]
---
SELECT * FROM `students` WHERE (`students`.user_id = 2) LIMIT 1